GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k40.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF45K40_INC_
#define _PIC18LF45K40_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18LF45K40
 */

/*
 * Device Registers
 */

// Register: RX2PPS
#define RX2PPS RX2PPS
RX2PPS                                   equ 0E8Dh
// bitfield definitions
RX2PPS_PIN_POSN                          equ 0000h
RX2PPS_PIN_POSITION                      equ 0000h
RX2PPS_PIN_SIZE                          equ 0003h
RX2PPS_PIN_LENGTH                        equ 0003h
RX2PPS_PIN_MASK                          equ 0007h
RX2PPS_PORT_POSN                         equ 0003h
RX2PPS_PORT_POSITION                     equ 0003h
RX2PPS_PORT_SIZE                         equ 0002h
RX2PPS_PORT_LENGTH                       equ 0002h
RX2PPS_PORT_MASK                         equ 0018h
RX2PPS_RXPPS_POSN                        equ 0000h
RX2PPS_RXPPS_POSITION                    equ 0000h
RX2PPS_RXPPS_SIZE                        equ 0005h
RX2PPS_RXPPS_LENGTH                      equ 0005h
RX2PPS_RXPPS_MASK                        equ 001Fh

// Register: CK2PPS
#define CK2PPS CK2PPS
CK2PPS                                   equ 0E8Eh
// bitfield definitions
CK2PPS_PIN_POSN                          equ 0000h
CK2PPS_PIN_POSITION                      equ 0000h
CK2PPS_PIN_SIZE                          equ 0003h
CK2PPS_PIN_LENGTH                        equ 0003h
CK2PPS_PIN_MASK                          equ 0007h
CK2PPS_PORT_POSN                         equ 0003h
CK2PPS_PORT_POSITION                     equ 0003h
CK2PPS_PORT_SIZE                         equ 0002h
CK2PPS_PORT_LENGTH                       equ 0002h
CK2PPS_PORT_MASK                         equ 0018h
CK2PPS_TXPPS_POSN                        equ 0000h
CK2PPS_TXPPS_POSITION                    equ 0000h
CK2PPS_TXPPS_SIZE                        equ 0005h
CK2PPS_TXPPS_LENGTH                      equ 0005h
CK2PPS_TXPPS_MASK                        equ 001Fh

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
SSP2CLKPPS                               equ 0E8Fh
// bitfield definitions
SSP2CLKPPS_PIN_POSN                      equ 0000h
SSP2CLKPPS_PIN_POSITION                  equ 0000h
SSP2CLKPPS_PIN_SIZE                      equ 0003h
SSP2CLKPPS_PIN_LENGTH                    equ 0003h
SSP2CLKPPS_PIN_MASK                      equ 0007h
SSP2CLKPPS_PORT_POSN                     equ 0003h
SSP2CLKPPS_PORT_POSITION                 equ 0003h
SSP2CLKPPS_PORT_SIZE                     equ 0002h
SSP2CLKPPS_PORT_LENGTH                   equ 0002h
SSP2CLKPPS_PORT_MASK                     equ 0018h
SSP2CLKPPS_SSPCLKPPS_POSN                equ 0000h
SSP2CLKPPS_SSPCLKPPS_POSITION            equ 0000h
SSP2CLKPPS_SSPCLKPPS_SIZE                equ 0005h
SSP2CLKPPS_SSPCLKPPS_LENGTH              equ 0005h
SSP2CLKPPS_SSPCLKPPS_MASK                equ 001Fh

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
SSP2DATPPS                               equ 0E90h
// bitfield definitions
SSP2DATPPS_PIN_POSN                      equ 0000h
SSP2DATPPS_PIN_POSITION                  equ 0000h
SSP2DATPPS_PIN_SIZE                      equ 0003h
SSP2DATPPS_PIN_LENGTH                    equ 0003h
SSP2DATPPS_PIN_MASK                      equ 0007h
SSP2DATPPS_PORT_POSN                     equ 0003h
SSP2DATPPS_PORT_POSITION                 equ 0003h
SSP2DATPPS_PORT_SIZE                     equ 0002h
SSP2DATPPS_PORT_LENGTH                   equ 0002h
SSP2DATPPS_PORT_MASK                     equ 0018h
SSP2DATPPS_SSPDATPPS_POSN                equ 0000h
SSP2DATPPS_SSPDATPPS_POSITION            equ 0000h
SSP2DATPPS_SSPDATPPS_SIZE                equ 0005h
SSP2DATPPS_SSPDATPPS_LENGTH              equ 0005h
SSP2DATPPS_SSPDATPPS_MASK                equ 001Fh

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
SSP2SSPPS                                equ 0E91h
// bitfield definitions
SSP2SSPPS_PIN_POSN                       equ 0000h
SSP2SSPPS_PIN_POSITION                   equ 0000h
SSP2SSPPS_PIN_SIZE                       equ 0003h
SSP2SSPPS_PIN_LENGTH                     equ 0003h
SSP2SSPPS_PIN_MASK                       equ 0007h
SSP2SSPPS_PORT_POSN                      equ 0003h
SSP2SSPPS_PORT_POSITION                  equ 0003h
SSP2SSPPS_PORT_SIZE                      equ 0002h
SSP2SSPPS_PORT_LENGTH                    equ 0002h
SSP2SSPPS_PORT_MASK                      equ 0018h
SSP2SSPPS_SSPSSPPS_POSN                  equ 0000h
SSP2SSPPS_SSPSSPPS_POSITION              equ 0000h
SSP2SSPPS_SSPSSPPS_SIZE                  equ 0005h
SSP2SSPPS_SSPSSPPS_LENGTH                equ 0005h
SSP2SSPPS_SSPSSPPS_MASK                  equ 001Fh

// Register: SSP2BUF
#define SSP2BUF SSP2BUF
SSP2BUF                                  equ 0E92h
// bitfield definitions
SSP2BUF_SSPBUF_POSN                      equ 0000h
SSP2BUF_SSPBUF_POSITION                  equ 0000h
SSP2BUF_SSPBUF_SIZE                      equ 0008h
SSP2BUF_SSPBUF_LENGTH                    equ 0008h
SSP2BUF_SSPBUF_MASK                      equ 00FFh

// Register: SSP2ADD
#define SSP2ADD SSP2ADD
SSP2ADD                                  equ 0E93h
// bitfield definitions
SSP2ADD_SSPADD_POSN                      equ 0000h
SSP2ADD_SSPADD_POSITION                  equ 0000h
SSP2ADD_SSPADD_SIZE                      equ 0008h
SSP2ADD_SSPADD_LENGTH                    equ 0008h
SSP2ADD_SSPADD_MASK                      equ 00FFh
SSP2ADD_MSK0_POSN                        equ 0000h
SSP2ADD_MSK0_POSITION                    equ 0000h
SSP2ADD_MSK0_SIZE                        equ 0001h
SSP2ADD_MSK0_LENGTH                      equ 0001h
SSP2ADD_MSK0_MASK                        equ 0001h
SSP2ADD_MSK1_POSN                        equ 0001h
SSP2ADD_MSK1_POSITION                    equ 0001h
SSP2ADD_MSK1_SIZE                        equ 0001h
SSP2ADD_MSK1_LENGTH                      equ 0001h
SSP2ADD_MSK1_MASK                        equ 0002h
SSP2ADD_MSK2_POSN                        equ 0002h
SSP2ADD_MSK2_POSITION                    equ 0002h
SSP2ADD_MSK2_SIZE                        equ 0001h
SSP2ADD_MSK2_LENGTH                      equ 0001h
SSP2ADD_MSK2_MASK                        equ 0004h
SSP2ADD_MSK3_POSN                        equ 0003h
SSP2ADD_MSK3_POSITION                    equ 0003h
SSP2ADD_MSK3_SIZE                        equ 0001h
SSP2ADD_MSK3_LENGTH                      equ 0001h
SSP2ADD_MSK3_MASK                        equ 0008h
SSP2ADD_MSK4_POSN                        equ 0004h
SSP2ADD_MSK4_POSITION                    equ 0004h
SSP2ADD_MSK4_SIZE                        equ 0001h
SSP2ADD_MSK4_LENGTH                      equ 0001h
SSP2ADD_MSK4_MASK                        equ 0010h
SSP2ADD_MSK5_POSN                        equ 0005h
SSP2ADD_MSK5_POSITION                    equ 0005h
SSP2ADD_MSK5_SIZE                        equ 0001h
SSP2ADD_MSK5_LENGTH                      equ 0001h
SSP2ADD_MSK5_MASK                        equ 0020h
SSP2ADD_MSK6_POSN                        equ 0006h
SSP2ADD_MSK6_POSITION                    equ 0006h
SSP2ADD_MSK6_SIZE                        equ 0001h
SSP2ADD_MSK6_LENGTH                      equ 0001h
SSP2ADD_MSK6_MASK                        equ 0040h
SSP2ADD_MSK7_POSN                        equ 0007h
SSP2ADD_MSK7_POSITION                    equ 0007h
SSP2ADD_MSK7_SIZE                        equ 0001h
SSP2ADD_MSK7_LENGTH                      equ 0001h
SSP2ADD_MSK7_MASK                        equ 0080h
SSP2ADD_MSK02_POSN                       equ 0000h
SSP2ADD_MSK02_POSITION                   equ 0000h
SSP2ADD_MSK02_SIZE                       equ 0001h
SSP2ADD_MSK02_LENGTH                     equ 0001h
SSP2ADD_MSK02_MASK                       equ 0001h
SSP2ADD_MSK12_POSN                       equ 0001h
SSP2ADD_MSK12_POSITION                   equ 0001h
SSP2ADD_MSK12_SIZE                       equ 0001h
SSP2ADD_MSK12_LENGTH                     equ 0001h
SSP2ADD_MSK12_MASK                       equ 0002h
SSP2ADD_MSK22_POSN                       equ 0002h
SSP2ADD_MSK22_POSITION                   equ 0002h
SSP2ADD_MSK22_SIZE                       equ 0001h
SSP2ADD_MSK22_LENGTH                     equ 0001h
SSP2ADD_MSK22_MASK                       equ 0004h
SSP2ADD_MSK32_POSN                       equ 0003h
SSP2ADD_MSK32_POSITION                   equ 0003h
SSP2ADD_MSK32_SIZE                       equ 0001h
SSP2ADD_MSK32_LENGTH                     equ 0001h
SSP2ADD_MSK32_MASK                       equ 0008h
SSP2ADD_MSK42_POSN                       equ 0004h
SSP2ADD_MSK42_POSITION                   equ 0004h
SSP2ADD_MSK42_SIZE                       equ 0001h
SSP2ADD_MSK42_LENGTH                     equ 0001h
SSP2ADD_MSK42_MASK                       equ 0010h
SSP2ADD_MSK52_POSN                       equ 0005h
SSP2ADD_MSK52_POSITION                   equ 0005h
SSP2ADD_MSK52_SIZE                       equ 0001h
SSP2ADD_MSK52_LENGTH                     equ 0001h
SSP2ADD_MSK52_MASK                       equ 0020h
SSP2ADD_MSK62_POSN                       equ 0006h
SSP2ADD_MSK62_POSITION                   equ 0006h
SSP2ADD_MSK62_SIZE                       equ 0001h
SSP2ADD_MSK62_LENGTH                     equ 0001h
SSP2ADD_MSK62_MASK                       equ 0040h
SSP2ADD_MSK72_POSN                       equ 0007h
SSP2ADD_MSK72_POSITION                   equ 0007h
SSP2ADD_MSK72_SIZE                       equ 0001h
SSP2ADD_MSK72_LENGTH                     equ 0001h
SSP2ADD_MSK72_MASK                       equ 0080h

