GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k40.inc
// Register: TX2REG
#define TX2REG TX2REG
TX2REG                                   equ 0E9Ah
// bitfield definitions
TX2REG_TX2REG_POSN                       equ 0000h
TX2REG_TX2REG_POSITION                   equ 0000h
TX2REG_TX2REG_SIZE                       equ 0008h
TX2REG_TX2REG_LENGTH                     equ 0008h
TX2REG_TX2REG_MASK                       equ 00FFh

// Register: SP2BRG
#define SP2BRG SP2BRG
SP2BRG                                   equ 0E9Bh

// Register: SP2BRGL
#define SP2BRGL SP2BRGL
SP2BRGL                                  equ 0E9Bh
// bitfield definitions
SP2BRGL_SP2BRGL_POSN                     equ 0000h
SP2BRGL_SP2BRGL_POSITION                 equ 0000h
SP2BRGL_SP2BRGL_SIZE                     equ 0008h
SP2BRGL_SP2BRGL_LENGTH                   equ 0008h
SP2BRGL_SP2BRGL_MASK                     equ 00FFh

// Register: SP2BRGH
#define SP2BRGH SP2BRGH
SP2BRGH                                  equ 0E9Ch
// bitfield definitions
SP2BRGH_SP2BRGH_POSN                     equ 0000h
SP2BRGH_SP2BRGH_POSITION                 equ 0000h
SP2BRGH_SP2BRGH_SIZE                     equ 0008h
SP2BRGH_SP2BRGH_LENGTH                   equ 0008h
SP2BRGH_SP2BRGH_MASK                     equ 00FFh

// Register: RC2STA
#define RC2STA RC2STA
RC2STA                                   equ 0E9Dh
// bitfield definitions
RC2STA_RX9D_POSN                         equ 0000h
RC2STA_RX9D_POSITION                     equ 0000h
RC2STA_RX9D_SIZE                         equ 0001h
RC2STA_RX9D_LENGTH                       equ 0001h
RC2STA_RX9D_MASK                         equ 0001h
RC2STA_OERR_POSN                         equ 0001h
RC2STA_OERR_POSITION                     equ 0001h
RC2STA_OERR_SIZE                         equ 0001h
RC2STA_OERR_LENGTH                       equ 0001h
RC2STA_OERR_MASK                         equ 0002h
RC2STA_FERR_POSN                         equ 0002h
RC2STA_FERR_POSITION                     equ 0002h
RC2STA_FERR_SIZE                         equ 0001h
RC2STA_FERR_LENGTH                       equ 0001h
RC2STA_FERR_MASK                         equ 0004h
RC2STA_ADDEN_POSN                        equ 0003h
RC2STA_ADDEN_POSITION                    equ 0003h
RC2STA_ADDEN_SIZE                        equ 0001h
RC2STA_ADDEN_LENGTH                      equ 0001h
RC2STA_ADDEN_MASK                        equ 0008h
RC2STA_CREN_POSN                         equ 0004h
RC2STA_CREN_POSITION                     equ 0004h
RC2STA_CREN_SIZE                         equ 0001h
RC2STA_CREN_LENGTH                       equ 0001h
RC2STA_CREN_MASK                         equ 0010h
RC2STA_SREN_POSN                         equ 0005h
RC2STA_SREN_POSITION                     equ 0005h
RC2STA_SREN_SIZE                         equ 0001h
RC2STA_SREN_LENGTH                       equ 0001h
RC2STA_SREN_MASK                         equ 0020h
RC2STA_RX9_POSN                          equ 0006h
RC2STA_RX9_POSITION                      equ 0006h
RC2STA_RX9_SIZE                          equ 0001h
RC2STA_RX9_LENGTH                        equ 0001h
RC2STA_RX9_MASK                          equ 0040h
RC2STA_SPEN_POSN                         equ 0007h
RC2STA_SPEN_POSITION                     equ 0007h
RC2STA_SPEN_SIZE                         equ 0001h
RC2STA_SPEN_LENGTH                       equ 0001h
RC2STA_SPEN_MASK                         equ 0080h
RC2STA_RC8_92_POSN                       equ 0006h
RC2STA_RC8_92_POSITION                   equ 0006h
RC2STA_RC8_92_SIZE                       equ 0001h
RC2STA_RC8_92_LENGTH                     equ 0001h
RC2STA_RC8_92_MASK                       equ 0040h
RC2STA_RC92_POSN                         equ 0006h
RC2STA_RC92_POSITION                     equ 0006h
RC2STA_RC92_SIZE                         equ 0001h
RC2STA_RC92_LENGTH                       equ 0001h
RC2STA_RC92_MASK                         equ 0040h
RC2STA_RCD82_POSN                        equ 0000h
RC2STA_RCD82_POSITION                    equ 0000h
RC2STA_RCD82_SIZE                        equ 0001h
RC2STA_RCD82_LENGTH                      equ 0001h
RC2STA_RCD82_MASK                        equ 0001h

// Register: TX2STA
#define TX2STA TX2STA
TX2STA                                   equ 0E9Eh
// bitfield definitions
TX2STA_TX9D_POSN                         equ 0000h
TX2STA_TX9D_POSITION                     equ 0000h
TX2STA_TX9D_SIZE                         equ 0001h
TX2STA_TX9D_LENGTH                       equ 0001h
TX2STA_TX9D_MASK                         equ 0001h
TX2STA_TRMT_POSN                         equ 0001h
TX2STA_TRMT_POSITION                     equ 0001h
TX2STA_TRMT_SIZE                         equ 0001h
TX2STA_TRMT_LENGTH                       equ 0001h
TX2STA_TRMT_MASK                         equ 0002h
TX2STA_BRGH_POSN                         equ 0002h
TX2STA_BRGH_POSITION                     equ 0002h
TX2STA_BRGH_SIZE                         equ 0001h
TX2STA_BRGH_LENGTH                       equ 0001h
TX2STA_BRGH_MASK                         equ 0004h
TX2STA_SENDB_POSN                        equ 0003h
TX2STA_SENDB_POSITION                    equ 0003h
TX2STA_SENDB_SIZE                        equ 0001h
TX2STA_SENDB_LENGTH                      equ 0001h
TX2STA_SENDB_MASK                        equ 0008h
TX2STA_SYNC_POSN                         equ 0004h
TX2STA_SYNC_POSITION                     equ 0004h
TX2STA_SYNC_SIZE                         equ 0001h
TX2STA_SYNC_LENGTH                       equ 0001h
TX2STA_SYNC_MASK                         equ 0010h
TX2STA_TXEN_POSN                         equ 0005h
TX2STA_TXEN_POSITION                     equ 0005h
TX2STA_TXEN_SIZE                         equ 0001h
TX2STA_TXEN_LENGTH                       equ 0001h
TX2STA_TXEN_MASK                         equ 0020h
TX2STA_TX9_POSN                          equ 0006h
TX2STA_TX9_POSITION                      equ 0006h
TX2STA_TX9_SIZE                          equ 0001h
TX2STA_TX9_LENGTH                        equ 0001h
TX2STA_TX9_MASK                          equ 0040h
TX2STA_CSRC_POSN                         equ 0007h
TX2STA_CSRC_POSITION                     equ 0007h
TX2STA_CSRC_SIZE                         equ 0001h
TX2STA_CSRC_LENGTH                       equ 0001h
TX2STA_CSRC_MASK                         equ 0080h
TX2STA_TX8_92_POSN                       equ 0006h
TX2STA_TX8_92_POSITION                   equ 0006h
TX2STA_TX8_92_SIZE                       equ 0001h
TX2STA_TX8_92_LENGTH                     equ 0001h
TX2STA_TX8_92_MASK                       equ 0040h
TX2STA_TXD82_POSN                        equ 0000h
TX2STA_TXD82_POSITION                    equ 0000h
TX2STA_TXD82_SIZE                        equ 0001h
TX2STA_TXD82_LENGTH                      equ 0001h
TX2STA_TXD82_MASK                        equ 0001h

// Register: BAUD2CON
#define BAUD2CON BAUD2CON
BAUD2CON                                 equ 0E9Fh
// bitfield definitions
BAUD2CON_ABDEN_POSN                      equ 0000h
BAUD2CON_ABDEN_POSITION                  equ 0000h
BAUD2CON_ABDEN_SIZE                      equ 0001h
BAUD2CON_ABDEN_LENGTH                    equ 0001h
BAUD2CON_ABDEN_MASK                      equ 0001h
BAUD2CON_WUE_POSN                        equ 0001h
BAUD2CON_WUE_POSITION                    equ 0001h
BAUD2CON_WUE_SIZE                        equ 0001h
BAUD2CON_WUE_LENGTH                      equ 0001h
BAUD2CON_WUE_MASK                        equ 0002h
BAUD2CON_BRG16_POSN                      equ 0003h
BAUD2CON_BRG16_POSITION                  equ 0003h
BAUD2CON_BRG16_SIZE                      equ 0001h
BAUD2CON_BRG16_LENGTH                    equ 0001h
BAUD2CON_BRG16_MASK                      equ 0008h
BAUD2CON_SCKP_POSN                       equ 0004h
BAUD2CON_SCKP_POSITION                   equ 0004h
BAUD2CON_SCKP_SIZE                       equ 0001h
BAUD2CON_SCKP_LENGTH                     equ 0001h
BAUD2CON_SCKP_MASK                       equ 0010h
BAUD2CON_RCIDL_POSN                      equ 0006h
BAUD2CON_RCIDL_POSITION                  equ 0006h
BAUD2CON_RCIDL_SIZE                      equ 0001h
BAUD2CON_RCIDL_LENGTH                    equ 0001h
BAUD2CON_RCIDL_MASK                      equ 0040h
BAUD2CON_ABDOVF_POSN                     equ 0007h
BAUD2CON_ABDOVF_POSITION                 equ 0007h
BAUD2CON_ABDOVF_SIZE                     equ 0001h
BAUD2CON_ABDOVF_LENGTH                   equ 0001h
BAUD2CON_ABDOVF_MASK                     equ 0080h
BAUD2CON_ABDEN2_POSN                     equ 0000h
BAUD2CON_ABDEN2_POSITION                 equ 0000h
BAUD2CON_ABDEN2_SIZE                     equ 0001h
BAUD2CON_ABDEN2_LENGTH                   equ 0001h
BAUD2CON_ABDEN2_MASK                     equ 0001h
BAUD2CON_ABDOVF2_POSN                    equ 0007h
BAUD2CON_ABDOVF2_POSITION                equ 0007h
BAUD2CON_ABDOVF2_SIZE                    equ 0001h
BAUD2CON_ABDOVF2_LENGTH                  equ 0001h
BAUD2CON_ABDOVF2_MASK                    equ 0080h
BAUD2CON_BRG162_POSN                     equ 0003h
BAUD2CON_BRG162_POSITION                 equ 0003h
BAUD2CON_BRG162_SIZE                     equ 0001h
BAUD2CON_BRG162_LENGTH                   equ 0001h
BAUD2CON_BRG162_MASK                     equ 0008h
BAUD2CON_RCIDL2_POSN                     equ 0006h
BAUD2CON_RCIDL2_POSITION                 equ 0006h
BAUD2CON_RCIDL2_SIZE                     equ 0001h
BAUD2CON_RCIDL2_LENGTH                   equ 0001h
BAUD2CON_RCIDL2_MASK                     equ 0040h
BAUD2CON_RCMT2_POSN                      equ 0006h
BAUD2CON_RCMT2_POSITION                  equ 0006h
BAUD2CON_RCMT2_SIZE                      equ 0001h
BAUD2CON_RCMT2_LENGTH                    equ 0001h
BAUD2CON_RCMT2_MASK                      equ 0040h
BAUD2CON_SCKP2_POSN                      equ 0004h
BAUD2CON_SCKP2_POSITION                  equ 0004h
BAUD2CON_SCKP2_SIZE                      equ 0001h
BAUD2CON_SCKP2_LENGTH                    equ 0001h
BAUD2CON_SCKP2_MASK                      equ 0010h
BAUD2CON_TXCKP2_POSN                     equ 0004h
BAUD2CON_TXCKP2_POSITION                 equ 0004h
BAUD2CON_TXCKP2_SIZE                     equ 0001h
BAUD2CON_TXCKP2_LENGTH                   equ 0001h
BAUD2CON_TXCKP2_MASK                     equ 0010h
BAUD2CON_WUE2_POSN                       equ 0001h
BAUD2CON_WUE2_POSITION                   equ 0001h
BAUD2CON_WUE2_SIZE                       equ 0001h
BAUD2CON_WUE2_LENGTH                     equ 0001h
BAUD2CON_WUE2_MASK                       equ 0002h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0EA0h
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

