GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k40.inc
// Register: RC1REG
#define RC1REG RC1REG
RC1REG                                   equ 0F99h
// bitfield definitions
RC1REG_RC1REG_POSN                       equ 0000h
RC1REG_RC1REG_POSITION                   equ 0000h
RC1REG_RC1REG_SIZE                       equ 0008h
RC1REG_RC1REG_LENGTH                     equ 0008h
RC1REG_RC1REG_MASK                       equ 00FFh

// Register: TX1REG
#define TX1REG TX1REG
TX1REG                                   equ 0F9Ah
// bitfield definitions
TX1REG_TX1REG_POSN                       equ 0000h
TX1REG_TX1REG_POSITION                   equ 0000h
TX1REG_TX1REG_SIZE                       equ 0008h
TX1REG_TX1REG_LENGTH                     equ 0008h
TX1REG_TX1REG_MASK                       equ 00FFh

// Register: SP1BRG
#define SP1BRG SP1BRG
SP1BRG                                   equ 0F9Bh

// Register: SP1BRGL
#define SP1BRGL SP1BRGL
SP1BRGL                                  equ 0F9Bh
// bitfield definitions
SP1BRGL_SP1BRGL_POSN                     equ 0000h
SP1BRGL_SP1BRGL_POSITION                 equ 0000h
SP1BRGL_SP1BRGL_SIZE                     equ 0008h
SP1BRGL_SP1BRGL_LENGTH                   equ 0008h
SP1BRGL_SP1BRGL_MASK                     equ 00FFh

// Register: SP1BRGH
#define SP1BRGH SP1BRGH
SP1BRGH                                  equ 0F9Ch
// bitfield definitions
SP1BRGH_SP1BRGH_POSN                     equ 0000h
SP1BRGH_SP1BRGH_POSITION                 equ 0000h
SP1BRGH_SP1BRGH_SIZE                     equ 0008h
SP1BRGH_SP1BRGH_LENGTH                   equ 0008h
SP1BRGH_SP1BRGH_MASK                     equ 00FFh

// Register: RC1STA
#define RC1STA RC1STA
RC1STA                                   equ 0F9Dh
// bitfield definitions
RC1STA_RX9D_POSN                         equ 0000h
RC1STA_RX9D_POSITION                     equ 0000h
RC1STA_RX9D_SIZE                         equ 0001h
RC1STA_RX9D_LENGTH                       equ 0001h
RC1STA_RX9D_MASK                         equ 0001h
RC1STA_OERR_POSN                         equ 0001h
RC1STA_OERR_POSITION                     equ 0001h
RC1STA_OERR_SIZE                         equ 0001h
RC1STA_OERR_LENGTH                       equ 0001h
RC1STA_OERR_MASK                         equ 0002h
RC1STA_FERR_POSN                         equ 0002h
RC1STA_FERR_POSITION                     equ 0002h
RC1STA_FERR_SIZE                         equ 0001h
RC1STA_FERR_LENGTH                       equ 0001h
RC1STA_FERR_MASK                         equ 0004h
RC1STA_ADDEN_POSN                        equ 0003h
RC1STA_ADDEN_POSITION                    equ 0003h
RC1STA_ADDEN_SIZE                        equ 0001h
RC1STA_ADDEN_LENGTH                      equ 0001h
RC1STA_ADDEN_MASK                        equ 0008h
RC1STA_CREN_POSN                         equ 0004h
RC1STA_CREN_POSITION                     equ 0004h
RC1STA_CREN_SIZE                         equ 0001h
RC1STA_CREN_LENGTH                       equ 0001h
RC1STA_CREN_MASK                         equ 0010h
RC1STA_SREN_POSN                         equ 0005h
RC1STA_SREN_POSITION                     equ 0005h
RC1STA_SREN_SIZE                         equ 0001h
RC1STA_SREN_LENGTH                       equ 0001h
RC1STA_SREN_MASK                         equ 0020h
RC1STA_RX9_POSN                          equ 0006h
RC1STA_RX9_POSITION                      equ 0006h
RC1STA_RX9_SIZE                          equ 0001h
RC1STA_RX9_LENGTH                        equ 0001h
RC1STA_RX9_MASK                          equ 0040h
RC1STA_SPEN_POSN                         equ 0007h
RC1STA_SPEN_POSITION                     equ 0007h
RC1STA_SPEN_SIZE                         equ 0001h
RC1STA_SPEN_LENGTH                       equ 0001h
RC1STA_SPEN_MASK                         equ 0080h
RC1STA_RC8_9_POSN                        equ 0006h
RC1STA_RC8_9_POSITION                    equ 0006h
RC1STA_RC8_9_SIZE                        equ 0001h
RC1STA_RC8_9_LENGTH                      equ 0001h
RC1STA_RC8_9_MASK                        equ 0040h
RC1STA_RC9_POSN                          equ 0006h
RC1STA_RC9_POSITION                      equ 0006h
RC1STA_RC9_SIZE                          equ 0001h
RC1STA_RC9_LENGTH                        equ 0001h
RC1STA_RC9_MASK                          equ 0040h
RC1STA_RCD8_POSN                         equ 0000h
RC1STA_RCD8_POSITION                     equ 0000h
RC1STA_RCD8_SIZE                         equ 0001h
RC1STA_RCD8_LENGTH                       equ 0001h
RC1STA_RCD8_MASK                         equ 0001h
RC1STA_SRENA_POSN                        equ 0005h
RC1STA_SRENA_POSITION                    equ 0005h
RC1STA_SRENA_SIZE                        equ 0001h
RC1STA_SRENA_LENGTH                      equ 0001h
RC1STA_SRENA_MASK                        equ 0020h

// Register: TX1STA
#define TX1STA TX1STA
TX1STA                                   equ 0F9Eh
// bitfield definitions
TX1STA_TX9D_POSN                         equ 0000h
TX1STA_TX9D_POSITION                     equ 0000h
TX1STA_TX9D_SIZE                         equ 0001h
TX1STA_TX9D_LENGTH                       equ 0001h
TX1STA_TX9D_MASK                         equ 0001h
TX1STA_TRMT_POSN                         equ 0001h
TX1STA_TRMT_POSITION                     equ 0001h
TX1STA_TRMT_SIZE                         equ 0001h
TX1STA_TRMT_LENGTH                       equ 0001h
TX1STA_TRMT_MASK                         equ 0002h
TX1STA_BRGH_POSN                         equ 0002h
TX1STA_BRGH_POSITION                     equ 0002h
TX1STA_BRGH_SIZE                         equ 0001h
TX1STA_BRGH_LENGTH                       equ 0001h
TX1STA_BRGH_MASK                         equ 0004h
TX1STA_SENDB_POSN                        equ 0003h
TX1STA_SENDB_POSITION                    equ 0003h
TX1STA_SENDB_SIZE                        equ 0001h
TX1STA_SENDB_LENGTH                      equ 0001h
TX1STA_SENDB_MASK                        equ 0008h
TX1STA_SYNC_POSN                         equ 0004h
TX1STA_SYNC_POSITION                     equ 0004h
TX1STA_SYNC_SIZE                         equ 0001h
TX1STA_SYNC_LENGTH                       equ 0001h
TX1STA_SYNC_MASK                         equ 0010h
TX1STA_TXEN_POSN                         equ 0005h
TX1STA_TXEN_POSITION                     equ 0005h
TX1STA_TXEN_SIZE                         equ 0001h
TX1STA_TXEN_LENGTH                       equ 0001h
TX1STA_TXEN_MASK                         equ 0020h
TX1STA_TX9_POSN                          equ 0006h
TX1STA_TX9_POSITION                      equ 0006h
TX1STA_TX9_SIZE                          equ 0001h
TX1STA_TX9_LENGTH                        equ 0001h
TX1STA_TX9_MASK                          equ 0040h
TX1STA_CSRC_POSN                         equ 0007h
TX1STA_CSRC_POSITION                     equ 0007h
TX1STA_CSRC_SIZE                         equ 0001h
TX1STA_CSRC_LENGTH                       equ 0001h
TX1STA_CSRC_MASK                         equ 0080h
TX1STA_TX8_9_POSN                        equ 0006h
TX1STA_TX8_9_POSITION                    equ 0006h
TX1STA_TX8_9_SIZE                        equ 0001h
TX1STA_TX8_9_LENGTH                      equ 0001h
TX1STA_TX8_9_MASK                        equ 0040h
TX1STA_TXD8_POSN                         equ 0000h
TX1STA_TXD8_POSITION                     equ 0000h
TX1STA_TXD8_SIZE                         equ 0001h
TX1STA_TXD8_LENGTH                       equ 0001h
TX1STA_TXD8_MASK                         equ 0001h
TX1STA_BRGH1_POSN                        equ 0002h
TX1STA_BRGH1_POSITION                    equ 0002h
TX1STA_BRGH1_SIZE                        equ 0001h
TX1STA_BRGH1_LENGTH                      equ 0001h
TX1STA_BRGH1_MASK                        equ 0004h
TX1STA_CSRC1_POSN                        equ 0007h
TX1STA_CSRC1_POSITION                    equ 0007h
TX1STA_CSRC1_SIZE                        equ 0001h
TX1STA_CSRC1_LENGTH                      equ 0001h
TX1STA_CSRC1_MASK                        equ 0080h
TX1STA_SENDB1_POSN                       equ 0003h
TX1STA_SENDB1_POSITION                   equ 0003h
TX1STA_SENDB1_SIZE                       equ 0001h
TX1STA_SENDB1_LENGTH                     equ 0001h
TX1STA_SENDB1_MASK                       equ 0008h
TX1STA_SYNC1_POSN                        equ 0004h
TX1STA_SYNC1_POSITION                    equ 0004h
TX1STA_SYNC1_SIZE                        equ 0001h
TX1STA_SYNC1_LENGTH                      equ 0001h
TX1STA_SYNC1_MASK                        equ 0010h
TX1STA_TRMT1_POSN                        equ 0001h
TX1STA_TRMT1_POSITION                    equ 0001h
TX1STA_TRMT1_SIZE                        equ 0001h
TX1STA_TRMT1_LENGTH                      equ 0001h
TX1STA_TRMT1_MASK                        equ 0002h
TX1STA_TX91_POSN                         equ 0006h
TX1STA_TX91_POSITION                     equ 0006h
TX1STA_TX91_SIZE                         equ 0001h
TX1STA_TX91_LENGTH                       equ 0001h
TX1STA_TX91_MASK                         equ 0040h
TX1STA_TX9D1_POSN                        equ 0000h
TX1STA_TX9D1_POSITION                    equ 0000h
TX1STA_TX9D1_SIZE                        equ 0001h
TX1STA_TX9D1_LENGTH                      equ 0001h
TX1STA_TX9D1_MASK                        equ 0001h
TX1STA_TXEN1_POSN                        equ 0005h
TX1STA_TXEN1_POSITION                    equ 0005h
TX1STA_TXEN1_SIZE                        equ 0001h
TX1STA_TXEN1_LENGTH                      equ 0001h
TX1STA_TXEN1_MASK                        equ 0020h

